Enterprise_Serivces/Cert/Gold/CSLProfileService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/Marketing/CustomerProfile/V1.0">ee378a17-4acc-475e-b100-509195a48980</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/Marketing/CustomerProfile/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/Marketing/CustomerProfile/V1.0/IProfileService/GetProfile</wsa:Action><wsa:MessageID>uuid:a4e3033b-662e-4ad7-ad30-cc9ef4805784</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslprofileserviceqa1.testgs.pvt/ProfileService.svc</wsa:To></soap:Header><soap:Body><GetProfileRequest xmlns="http://www.gamestop.com/CSL/Marketing/CustomerProfile/V1.0"><OpenIdClaimedIdentifier>https://loginqa.gamestop.com/ID/yEPew3_h3EKZyIMggHO-_A</OpenIdClaimedIdentifier></GetProfileRequest></soap:Body></soap:Envelope>